backend: tensorflow
class_name: Model
config:
  input_layers:
  - input_1
  - 0
  - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 32
      - 32
      - 3
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 3
      - 3
      name: block1_conv1
      padding: same
      strides: &id002 !!python/tuple
      - 1
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - input_1
      - 0
      - 0
      - {}
    name: block1_conv1
  - class_name: Model
    config:
      input_layers:
      - input_2
      - 0
      - 0
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple
          - null
          - 32
          - 32
          - 64
          dtype: float32
          name: input_2
          sparse: false
        inbound_nodes: []
        name: input_2
      - class_name: SeparableConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          depthwise_regularizer: null
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: separable_conv2d
          padding: same
          pointwise_constraint: null
          pointwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          pointwise_regularizer: null
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - input_2
          - 0
          - 0
          - {}
        name: separable_conv2d
      - class_name: SeparableConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          depthwise_regularizer: null
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: separable_conv2d_1
          padding: same
          pointwise_constraint: null
          pointwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          pointwise_regularizer: null
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - separable_conv2d
          - 0
          - 0
          - {}
        name: separable_conv2d_1
      - class_name: SeparableConv2D
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          depth_multiplier: 1
          depthwise_constraint: null
          depthwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          depthwise_regularizer: null
          dilation_rate: !!python/tuple
          - 1
          - 1
          dtype: float32
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: separable_conv2d_2
          padding: same
          pointwise_constraint: null
          pointwise_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          pointwise_regularizer: null
          strides: !!python/tuple
          - 1
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - separable_conv2d_1
          - 0
          - 0
          - {}
        name: separable_conv2d_2
      name: model_1
      output_layers:
      - separable_conv2d_2
      - 0
      - 0
    inbound_nodes:
    - - block1_conv1
      - 0
      - 0
      - {}
    name: model_1
  - class_name: Sequential
    config:
      build_input_shape: !!python/tuple
      - null
      - 32
      - 32
      - 64
      layers:
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block1_pool
          padding: valid
          pool_size: !!python/tuple
          - 2
          - 2
          strides: !!python/tuple
          - 2
          - 2
          trainable: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block2_conv1
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 128
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block2_conv2
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block2_pool
          padding: valid
          pool_size: !!python/tuple
          - 2
          - 2
          strides: !!python/tuple
          - 2
          - 2
          trainable: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 256
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block3_conv1
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 256
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block3_conv2
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 256
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block3_conv3
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block3_pool
          padding: valid
          pool_size: !!python/tuple
          - 2
          - 2
          strides: !!python/tuple
          - 2
          - 2
          trainable: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block4_conv1
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block4_conv2
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block4_conv3
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block4_pool
          padding: valid
          pool_size: !!python/tuple
          - 2
          - 2
          strides: !!python/tuple
          - 2
          - 2
          trainable: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block5_conv1
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block5_conv2
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: Conv2D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: *id001
          dtype: float32
          filters: 512
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          - 3
          name: block5_conv3
          padding: same
          strides: *id002
          trainable: true
          use_bias: true
      - class_name: MaxPooling2D
        config:
          data_format: channels_last
          dtype: float32
          name: block5_pool
          padding: valid
          pool_size: !!python/tuple
          - 2
          - 2
          strides: !!python/tuple
          - 2
          - 2
          trainable: true
      - class_name: Flatten
        config:
          data_format: channels_last
          dtype: float32
          name: flatten
          trainable: true
      - class_name: Dense
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          name: fc1
          trainable: true
          units: 4096
          use_bias: true
      - class_name: Dense
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          name: fc2
          trainable: true
          units: 4096
          use_bias: true
      - class_name: Dense
        config:
          activation: softmax
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dtype: float32
          kernel_constraint: null
          kernel_initializer:
            class_name: GlorotUniform
            config:
              seed: null
          kernel_regularizer: null
          name: predictions
          trainable: true
          units: 10
          use_bias: true
      name: sequential
    inbound_nodes:
    - - model_1
      - 1
      - 0
      - {}
    name: sequential
  name: model_4
  output_layers:
  - sequential
  - 1
  - 0
keras_version: 2.2.4-tf
